app/controllers/organisations_controller.rb

  def index
    @organisations = Organisation.all
---
SELECT * FROM "organisations"

  def show
    @organisation = Organisation.find(params[:id])
---
SELECT * FROM "organisations" WHERE ("organisations"."id" = 980190962)

  def edit
    @organisation = Organisation.find(params[:id])
---
SELECT * FROM "organisations" WHERE ("organisations"."id" = 980190962)

  def update
    @organisation = Organisation.find(params[:id])
---
SELECT * FROM "organisations" WHERE ("organisations"."id" = 980190962)

  def destroy
    @organisation = Organisation.find(params[:id])
    @organisation.destroy
---
SELECT * FROM "organisations" WHERE ("organisations"."id" = 980190962)
DELETE FROM "organisations" WHERE "id" = 980190962